# алгоритм получения цифр n-значного числа
num = 4578
d = num % 10
c = (num % 100)//10
b = (num % 1000)//100
a = num//1000
print(a, b, c, d, sep='')
# можно такой 
num1 = 5478
d1 = num1 % 10
c1 = num1 // 10 % 10
b1 = num1 // 100 % 10
a1 = num1 // 1000
print(a1, b1, c1, d1, sep='')
# алгоритм получения цифр 5-значного числа
dig = 47896
d5 = dig%10
d4 = dig%100//10
d3 = dig%1000//100
d2 = dig%10000//1000
d1 = dig//10000
print(d1, d2, d3, d4, d5, sep='')

dig1 = 14589
d55 = dig1%10
d44 = dig1//10%10
d33 = dig1//100%10
d22 = dig1//1000%10
d11 = dig1//10000
print(d11, d22, d33, d44, d55, sep='')